Autodesk.Revit.DB.AssemblyViewUtils.AcquireAssemblyViews(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Transfers the assembly views owned by a source assembly instance to a target sibling assembly instance of the same assembly type.
document:
The document in which the assembly instances live.
sourceAssemblyInstanceId:
Id of the assembly instance that currently owns the assembly views.
targetAssemblyInstanceId:
Id of the assembly instance which will become the new owner of the assembly views.
Throws Autodesk.Revit.Exceptions.ArgumentException:
sourceAssemblyInstanceId is not an AssemblyInstance with assembly views.
-or-
targetAssemblyInstanceId is not an AssemblyInstance.
-or-
sourceAssemblyInstanceId and targetAssemblyInstanceId are not AssemblyInstances from the same assembly type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.AssemblyViewUtils.CreateSheet(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new sheet assembly view for the assembly instance.
Remarks:
The document must be regenerated before using the sheet.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
titleBlockId:
Id of the titleblock family to use.  For no titleblock, pass invalidElementId.
Returns:
A new sheet assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
-or-
titleBlockId is not a TitleBlock.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.AssemblyViewUtils.CreateMaterialTakeoff(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a new material takeoff multicategory schedule assembly view for the assembly instance.
Remarks:
The material takeoff schedule will be preloaded with fields "Material: Name" and "Material: Volume".
The document must be regenerated before using the schedule.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
viewTemplateId:
Id of the view template that is used to create the view;
if invalidElementId, the view will be created with the default settings.
isAssigned:
If true, the template will be assigned, if false, the template will be applied.
Returns:
A new material takeoff multicategory schedule assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
-or-
viewTemplateId is not a correct view template for the schedule view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.AssemblyViewUtils.CreateMaterialTakeoff(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new material takeoff multicategory schedule assembly view for the assembly instance.
Remarks:
The material takeoff schedule will be preloaded with fields "Material: Name" and "Material: Volume".
The document must be regenerated before using the schedule.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
Returns:
A new material takeoff multicategory schedule assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.AssemblyViewUtils.CreatePartList(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a new part list multicategory schedule assembly view for the assembly instance.
Remarks:
The new part list schedule will be preloaded with fields "Category", "Family and Type" and "Count".
The document must be regenerated before using the schedule.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
viewTemplateId:
Id of the view template that is used to create the view;
if invalidElementId, the view will be created with the default settings.
isAssigned:
If true, the template will be assigned, if false, the template will be applied.
Returns:
A new part list multicategory schedule assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
-or-
viewTemplateId is not a correct view template for the schedule view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.AssemblyViewUtils.CreatePartList(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new part list multicategory schedule assembly view for the assembly instance.
Remarks:
The new part list schedule will be preloaded with fields "Category", "Family and Type" and "Count".
The document must be regenerated before using the schedule.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
Returns:
A new part list multicategory schedule assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.AssemblyViewUtils.CreateSingleCategorySchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a new single-category schedule assembly view for the assembly instance.
Remarks:
The new single-category schedule will be preloaded with fields "Family and Type" and "Count".
The schedule will be empty if there are no elements of the specified category in the assembly instance.
The document must be regenerated before using the schedule.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
scheduleCategoryId:
Id of the category for which the schedule will be created.
Use ViewSchedule.IsValidCategoryForSchedule() to check if a category can be scheduled.
viewTemplateId:
Id of the view template that is used to create the view;
if invalidElementId, the view will be created with the default settings.
isAssigned:
If true, the template will be assigned, if false, the template will be applied.
Returns:
A new single-category schedule assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
-or-
scheduleCategoryId is not a valid category for a regular schedule.
-or-
viewTemplateId is not a correct view template for the schedule view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.AssemblyViewUtils.CreateSingleCategorySchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new single-category schedule assembly view for the assembly instance.
Remarks:
The new single-category schedule will be preloaded with fields "Family and Type" and "Count".
The schedule will be empty if there are no elements of the specified category in the assembly instance.
The document must be regenerated before using the schedule.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
scheduleCategoryId:
Id of the category for which the schedule will be created.
Use ViewSchedule.IsValidCategoryForSchedule() to check if a category can be scheduled.
Returns:
A new single-category schedule assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
-or-
scheduleCategoryId is not a valid category for a regular schedule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.AssemblyViewUtils.CreateDetailSection(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.AssemblyDetailViewOrientation,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a new detail section assembly view for the assembly instance.
Remarks:
The detail section will cut through the center of the assembly instance's outline.
The document must be regenerated before using the detail section.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
direction:
The direction for the new view.
viewTemplateId:
Id of the view template that is used to create the view; if invalidElementId, the view will be created with the default settings.
isAssigned:
If true, the template will be assigned; if false, the template will be applied.
Returns:
A new detail section assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
-or-
viewTemplateId is not a correct view template for the geom view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.AssemblyViewUtils.CreateDetailSection(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.AssemblyDetailViewOrientation)
Creates a new detail section assembly view for the assembly instance.
Remarks:
The detail section will cut through the center of the assembly instance's outline.
The document must be regenerated before using the detail section.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
direction:
The direction for the new view.
Returns:
A new detail section assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.AssemblyViewUtils.Create3DOrthographic(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a new orthographic 3D assembly view for the assembly instance.
The view will have the same orientation as the Default 3D view.
The document must be regenerated before using the 3D view.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
viewTemplateId:
Id of the view template that is used to create the view;
if invalidElementId, the view will be created with the default settings.
isAssigned:
If true, the template will be assigned, if false, the template will be applied.
Returns:
A new orthographic 3D assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
-or-
viewTemplateId is not a correct view template for the geom view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.AssemblyViewUtils.Create3DOrthographic(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new orthographic 3D assembly view for the assembly instance.
Remarks:
The view will have the same orientation as the Default 3D view.
The document must be regenerated before using the 3D view.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
Returns:
A new orthographic 3D assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.AssemblyViewUtils
Utilities that provide capabilities related to assembly view creation and validation.
Since:
2012